# How to read and write tabular data

![How to read and write tabular data](images/02_io_readwrite.svg)

## Import Pandas

In [1]:
# This line imports the pandas library and aliases it as 'pd'.
# Aliasing pandas as 'pd' is a widely adopted convention that simplifies the syntax for accessing its functionalities.
# After this statement, you can use 'pd' to access all the functionalities provided by the pandas library.

import pandas as pd

## Finding our current working directory

In [2]:
# The %pwd command is known as a "magic command" in Jupyter Notebook.
# (You can read more about magic commands here: https://www.geeksforgeeks.org/useful-ipython-magic-commands/)
# It is used to display the current working directory (cwd) within the notebook environment.
# This is the folder where the Jupyter Notebook is running.
# Understanding the current working directory is important for file operations like reading and writing files.

%pwd

'/Users/danielpryn/GIT/python/docs/pandas'

## Creating a `DataFrame` from a csv file

In [3]:
# Load the Titanic dataset from a CSV file into a DataFrame named 'titanic'.
# The 'pd.read_csv()' function is used to read the data from the file 'data/titanic.csv'.
# The file is located in the 'data' directory, relative to the current working directory.
# The resulting DataFrame 'titanic' contains the dataset, ready for analysis and manipulation.

titanic = pd.read_csv('data/titanic.csv')

In [4]:
# Display the DataFrame 'titanic'.
# Note, even though we only see the first and last five rows, we actually read the whole DataFrame into the kernel's memory.
# The pressure on memory usage can be alleviated by using the 'head()' method described below.
# However, this will only be an issue with very large datasets, so don't worry too much about it for now.
# You can find out how much memory a DataFrame uses by using the 'memory_usage()' method:
# titanic.memory_usage(deep=True).sum()

titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [5]:
# Use the 'shape' attribute to determine the dimensions of the DataFrame 'titanic'.
# It returns a tuple representing the number of rows and columns (rows, columns).

titanic.shape

(891, 12)

In [6]:
# Display the first few rows of the 'titanic' DataFrame using the 'head()' method.
# This provides a quick overview of the dataset, showing the column names and the first few rows of data.

titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
# Display the last three rows of the 'titanic' DataFrame using the 'tail()' method and specifying 3 as argument.
# This allows us to inspect the end of the dataset, showing the last few rows of data.

titanic.tail(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [8]:
# Display the first 80 rows of the 'titanic' DataFrame using the 'head()' method.

titanic.head(80)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.00,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.00,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.00,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.00,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.00,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
75,76,0,3,"Moen, Mr. Sigurd Hansen",male,25.00,0,0,348123,7.6500,F G73,S
76,77,0,3,"Staneff, Mr. Ivan",male,NaN,0,0,349208,7.8958,NaN,S
77,78,0,3,"Moutal, Mr. Rahamin Haim",male,NaN,0,0,374746,8.0500,NaN,S
78,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S
79,80,1,3,"Dowdell, Miss. Elizabeth",female,30.00,0,0,364516,12.4750,NaN,S

### Note on `head()` and `tail()`

By default, Pandas limits the display of rows in a `DataFrame` to a maximum of 60 rows.\
Calling a number higher than 60 will display the first five rows followed by an ellipsis (`...`), indicating that rows are being skipped, and then display the last five rows of the `DataFrame`.\
To display all rows without truncation, you can set the `max_rows` option to `None` using `pd.set_option()`:\
`pd.set_option('display.max_rows', None)`

Likewise, Pandas limits the display of columns in a `DataFrame` to a maximum of 20 columns.\
To display all columns without truncation, you can set the `max_columns` option to `None` using `pd.set_option()`:\
`pd.set_option('display.max_columns', None)`

In [9]:
# Use the 'dtypes' attribute to view the data types of each column in the 'titanic' DataFrame.
# This command provides information about the data type of each column, such as integer, float, or object (string).

titanic.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [10]:
# Use the 'info()' method to display a concise summary of the 'titanic' DataFrame.
# This command provides essential information about the DataFrame, including the number of non-null values in each column,
# the data type of each column, and memory usage.

titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

## The `notna()` conditional function returns a `True` for each row where the values are not a `Null` value

In [11]:
# Use the 'notna()' method to create a boolean DataFrame indicating whether each element in 'titanic' is not null.
# This command returns a DataFrame of the same shape as 'titanic',
# where True indicates a non-null value (i.e., not NaN), and False indicates a null value.

titanic.notna()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,True,True,True,True,True,True,True,True,True,True,False,True
1,True,True,True,True,True,True,True,True,True,True,True,True
2,True,True,True,True,True,True,True,True,True,True,False,True
3,True,True,True,True,True,True,True,True,True,True,True,True
4,True,True,True,True,True,True,True,True,True,True,False,True
...,...,...,...,...,...,...,...,...,...,...,...,...
886,True,True,True,True,True,True,True,True,True,True,False,True
887,True,True,True,True,True,True,True,True,True,True,True,True
888,True,True,True,True,True,False,True,True,True,True,False,True
889,True,True,True,True,True,True,True,True,True,True,True,True
890,True,True,True,True,True,True,True,True,True,True,False,True

In [12]:
# Use the 'notna()' method followed by 'sum()' to count the non-null values in each column of the 'titanic' DataFrame.
# This command calculates the sum of True values (non-null) along each column axis, providing a count of non-null values for each column.

titanic.notna().sum()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

## The `isna()` conditional function returns a `True` for each row where the values are a `Null` value

In [13]:
# Use the 'isna()' method to create a boolean DataFrame indicating whether each element in 'titanic' is null.
# This command returns a DataFrame of the same shape as 'titanic', where True indicates a null value,
# and False indicates a non-null value.

titanic.isna()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [14]:
# Use the 'isna()' method followed by 'sum()' to count the null values in each column of the 'titanic' DataFrame.
# This command calculates the sum of True values (null) along each column axis, providing a count of null values for each column.

titanic.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [15]:
# Filter the 'titanic' DataFrame to select rows where the 'PassengerId' column equals 666.
# This command returns a subset of the DataFrame containing only the rows where the 'PassengerId' column has a value of 666.

titanic[titanic['PassengerId'] == 666]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
665,666,0,2,"Hickman, Mr. Lewis",male,32.0,2,0,S.O.C. 14879,73.5,NaN,S

## Exercise:
* Extract the two passengers whose point of departure ('Embarked') is unknown (`NaN`)

<details>
  <summary>Click to reveal solution</summary>
  <br/>
    
`titanic[titanic['Embarked'].isna()]`

This solution uses boolean indexing to filter the `DataFrame` 'titanic', extracting only the rows where the 'Embarked' column contains missing values (`NaN`).\
This approach allows us to identify the passengers whose point of departure is unknown.
    
</details>

## Converting a DataFrame to an Excel file

In [16]:
# Write the DataFrame 'titanic' to an Excel file named 'titanic.xlsx'.
# The 'to_excel()' method is used to save the DataFrame to an Excel file.
# The parameter 'index=False' specifies that we do not want to include the row index in the Excel file.

titanic.to_excel('titanic.xlsx', index=False)

In [17]:
# Read data from an Excel file named 'titanic.xlsx' into a DataFrame using the 'read_excel()' function from pandas.
# Note, that we are only reading the data, not storing it in a variable.

pd.read_excel('titanic.xlsx')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

## REMEMBER

* Getting data in to pandas from many different file formats or data sources is supported by `read_*` functions.

* The `head()`, `tail()`, and `info()` methods are convenient for a first check.

* The `notna()` and `isna()` methods are useful for finding and isolating missing data.

* Exporting data out of pandas is provided by different `to_*` methods.